MikroElektronika/core_packages/PIC/XC8/def/PIC18F8527/mcu.h
extern volatile PORTHbits_t PORTHbits __at(0xF87);
// bitfield macros
#define _PORTH_RH0_POSN                                     0x0
#define _PORTH_RH0_POSITION                                 0x0
#define _PORTH_RH0_SIZE                                     0x1
#define _PORTH_RH0_LENGTH                                   0x1
#define _PORTH_RH0_MASK                                     0x1
#define _PORTH_RH1_POSN                                     0x1
#define _PORTH_RH1_POSITION                                 0x1
#define _PORTH_RH1_SIZE                                     0x1
#define _PORTH_RH1_LENGTH                                   0x1
#define _PORTH_RH1_MASK                                     0x2
#define _PORTH_RH2_POSN                                     0x2
#define _PORTH_RH2_POSITION                                 0x2
#define _PORTH_RH2_SIZE                                     0x1
#define _PORTH_RH2_LENGTH                                   0x1
#define _PORTH_RH2_MASK                                     0x4
#define _PORTH_RH3_POSN                                     0x3
#define _PORTH_RH3_POSITION                                 0x3
#define _PORTH_RH3_SIZE                                     0x1
#define _PORTH_RH3_LENGTH                                   0x1
#define _PORTH_RH3_MASK                                     0x8
#define _PORTH_RH4_POSN                                     0x4
#define _PORTH_RH4_POSITION                                 0x4
#define _PORTH_RH4_SIZE                                     0x1
#define _PORTH_RH4_LENGTH                                   0x1
#define _PORTH_RH4_MASK                                     0x10
#define _PORTH_RH5_POSN                                     0x5
#define _PORTH_RH5_POSITION                                 0x5
#define _PORTH_RH5_SIZE                                     0x1
#define _PORTH_RH5_LENGTH                                   0x1
#define _PORTH_RH5_MASK                                     0x20
#define _PORTH_RH6_POSN                                     0x6
#define _PORTH_RH6_POSITION                                 0x6
#define _PORTH_RH6_SIZE                                     0x1
#define _PORTH_RH6_LENGTH                                   0x1
#define _PORTH_RH6_MASK                                     0x40
#define _PORTH_RH7_POSN                                     0x7
#define _PORTH_RH7_POSITION                                 0x7
#define _PORTH_RH7_SIZE                                     0x1
#define _PORTH_RH7_LENGTH                                   0x1
#define _PORTH_RH7_MASK                                     0x80
#define _PORTH_A16_POSN                                     0x0
#define _PORTH_A16_POSITION                                 0x0
#define _PORTH_A16_SIZE                                     0x1
#define _PORTH_A16_LENGTH                                   0x1
#define _PORTH_A16_MASK                                     0x1
#define _PORTH_A17_POSN                                     0x1
#define _PORTH_A17_POSITION                                 0x1
#define _PORTH_A17_SIZE                                     0x1
#define _PORTH_A17_LENGTH                                   0x1
#define _PORTH_A17_MASK                                     0x2
#define _PORTH_A18_POSN                                     0x2
#define _PORTH_A18_POSITION                                 0x2
#define _PORTH_A18_SIZE                                     0x1
#define _PORTH_A18_LENGTH                                   0x1
#define _PORTH_A18_MASK                                     0x4
#define _PORTH_A19_POSN                                     0x3
#define _PORTH_A19_POSITION                                 0x3
#define _PORTH_A19_SIZE                                     0x1
#define _PORTH_A19_LENGTH                                   0x1
#define _PORTH_A19_MASK                                     0x8
#define _PORTH_AN12_POSN                                    0x4
#define _PORTH_AN12_POSITION                                0x4
#define _PORTH_AN12_SIZE                                    0x1
#define _PORTH_AN12_LENGTH                                  0x1
#define _PORTH_AN12_MASK                                    0x10
#define _PORTH_AN13_POSN                                    0x5
#define _PORTH_AN13_POSITION                                0x5
#define _PORTH_AN13_SIZE                                    0x1
#define _PORTH_AN13_LENGTH                                  0x1
#define _PORTH_AN13_MASK                                    0x20
#define _PORTH_AN14_POSN                                    0x6
#define _PORTH_AN14_POSITION                                0x6
#define _PORTH_AN14_SIZE                                    0x1
#define _PORTH_AN14_LENGTH                                  0x1
#define _PORTH_AN14_MASK                                    0x40
#define _PORTH_AN15_POSN                                    0x7
#define _PORTH_AN15_POSITION                                0x7
#define _PORTH_AN15_SIZE                                    0x1
#define _PORTH_AN15_LENGTH                                  0x1
#define _PORTH_AN15_MASK                                    0x80
#define _PORTH_P3C_POSN                                     0x4
#define _PORTH_P3C_POSITION                                 0x4
#define _PORTH_P3C_SIZE                                     0x1
#define _PORTH_P3C_LENGTH                                   0x1
#define _PORTH_P3C_MASK                                     0x10
#define _PORTH_P3B_POSN                                     0x5
#define _PORTH_P3B_POSITION                                 0x5
#define _PORTH_P3B_SIZE                                     0x1
#define _PORTH_P3B_LENGTH                                   0x1
#define _PORTH_P3B_MASK                                     0x20
#define _PORTH_P1C_POSN                                     0x6
#define _PORTH_P1C_POSITION                                 0x6
#define _PORTH_P1C_SIZE                                     0x1
#define _PORTH_P1C_LENGTH                                   0x1
#define _PORTH_P1C_MASK                                     0x40
#define _PORTH_P1B_POSN                                     0x7
#define _PORTH_P1B_POSITION                                 0x7
#define _PORTH_P1B_SIZE                                     0x1
#define _PORTH_P1B_LENGTH                                   0x1
#define _PORTH_P1B_MASK                                     0x80
#define _PORTH_CCP9_POSN                                    0x4
#define _PORTH_CCP9_POSITION                                0x4
#define _PORTH_CCP9_SIZE                                    0x1
#define _PORTH_CCP9_LENGTH                                  0x1
#define _PORTH_CCP9_MASK                                    0x10
#define _PORTH_CCP8_POSN                                    0x5
#define _PORTH_CCP8_POSITION                                0x5
#define _PORTH_CCP8_SIZE                                    0x1
#define _PORTH_CCP8_LENGTH                                  0x1
#define _PORTH_CCP8_MASK                                    0x20
#define _PORTH_CCP7_POSN                                    0x6
#define _PORTH_CCP7_POSITION                                0x6
#define _PORTH_CCP7_SIZE                                    0x1
#define _PORTH_CCP7_LENGTH                                  0x1
#define _PORTH_CCP7_MASK                                    0x40
#define _PORTH_CCP6_POSN                                    0x7
#define _PORTH_CCP6_POSITION                                0x7
#define _PORTH_CCP6_SIZE                                    0x1
#define _PORTH_CCP6_LENGTH                                  0x1
#define _PORTH_CCP6_MASK                                    0x80
#define _PORTH_PC3_POSN                                     0x4
#define _PORTH_PC3_POSITION                                 0x4
#define _PORTH_PC3_SIZE                                     0x1
#define _PORTH_PC3_LENGTH                                   0x1
#define _PORTH_PC3_MASK                                     0x10
#define _PORTH_PB3_POSN                                     0x5
#define _PORTH_PB3_POSITION                                 0x5
#define _PORTH_PB3_SIZE                                     0x1
#define _PORTH_PB3_LENGTH                                   0x1
#define _PORTH_PB3_MASK                                     0x20
#define _PORTH_PC1_POSN                                     0x6
#define _PORTH_PC1_POSITION                                 0x6
#define _PORTH_PC1_SIZE                                     0x1
#define _PORTH_PC1_LENGTH                                   0x1
#define _PORTH_PC1_MASK                                     0x40
#define _PORTH_PB1_POSN                                     0x7
#define _PORTH_PB1_POSITION                                 0x7
#define _PORTH_PB1_SIZE                                     0x1
#define _PORTH_PB1_LENGTH                                   0x1
#define _PORTH_PB1_MASK                                     0x80

// Register: PORTJ
#define PORTJ PORTJ
extern volatile unsigned char           PORTJ               __at(0xF88);
#ifndef _LIB_BUILD
asm("PORTJ equ 0F88h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RJ0                    :1;
        unsigned RJ1                    :1;
        unsigned RJ2                    :1;
        unsigned RJ3                    :1;
        unsigned RJ4                    :1;
        unsigned RJ5                    :1;
        unsigned RJ6                    :1;
        unsigned RJ7                    :1;
    };
    struct {
        unsigned ALE                    :1;
        unsigned OE                     :1;
        unsigned WRL                    :1;
        unsigned WRH                    :1;
        unsigned BA0                    :1;
        unsigned CE                     :1;
        unsigned LB                     :1;
        unsigned UB                     :1;
    };
    struct {
        unsigned                        :1;
        unsigned NOT_OE                 :1;
    };
    struct {
        unsigned                        :2;
        unsigned NOT_WRL                :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_WRH                :1;
    };
    struct {
        unsigned                        :5;
        unsigned NOT_CE                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned NOT_LB                 :1;
    };
    struct {
        unsigned                        :7;
        unsigned NOT_UB                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned nOE                    :1;
        unsigned nWRL                   :1;
        unsigned nWRH                   :1;
        unsigned                        :1;
        unsigned nCE                    :1;
        unsigned nLB                    :1;
        unsigned nUB                    :1;
    };
} PORTJbits_t;
extern volatile PORTJbits_t PORTJbits __at(0xF88);
// bitfield macros
#define _PORTJ_RJ0_POSN                                     0x0
#define _PORTJ_RJ0_POSITION                                 0x0
#define _PORTJ_RJ0_SIZE                                     0x1
#define _PORTJ_RJ0_LENGTH                                   0x1
#define _PORTJ_RJ0_MASK                                     0x1
#define _PORTJ_RJ1_POSN                                     0x1
#define _PORTJ_RJ1_POSITION                                 0x1
#define _PORTJ_RJ1_SIZE                                     0x1
#define _PORTJ_RJ1_LENGTH                                   0x1
#define _PORTJ_RJ1_MASK                                     0x2
#define _PORTJ_RJ2_POSN                                     0x2
#define _PORTJ_RJ2_POSITION                                 0x2
#define _PORTJ_RJ2_SIZE                                     0x1
#define _PORTJ_RJ2_LENGTH                                   0x1
#define _PORTJ_RJ2_MASK                                     0x4
#define _PORTJ_RJ3_POSN                                     0x3
#define _PORTJ_RJ3_POSITION                                 0x3
#define _PORTJ_RJ3_SIZE                                     0x1
#define _PORTJ_RJ3_LENGTH                                   0x1
#define _PORTJ_RJ3_MASK                                     0x8
#define _PORTJ_RJ4_POSN                                     0x4
#define _PORTJ_RJ4_POSITION                                 0x4
#define _PORTJ_RJ4_SIZE                                     0x1
#define _PORTJ_RJ4_LENGTH                                   0x1
#define _PORTJ_RJ4_MASK                                     0x10
#define _PORTJ_RJ5_POSN                                     0x5
#define _PORTJ_RJ5_POSITION                                 0x5
#define _PORTJ_RJ5_SIZE                                     0x1
#define _PORTJ_RJ5_LENGTH                                   0x1
#define _PORTJ_RJ5_MASK                                     0x20
#define _PORTJ_RJ6_POSN                                     0x6
#define _PORTJ_RJ6_POSITION                                 0x6
#define _PORTJ_RJ6_SIZE                                     0x1
#define _PORTJ_RJ6_LENGTH                                   0x1
#define _PORTJ_RJ6_MASK                                     0x40
#define _PORTJ_RJ7_POSN                                     0x7
#define _PORTJ_RJ7_POSITION                                 0x7
#define _PORTJ_RJ7_SIZE                                     0x1
#define _PORTJ_RJ7_LENGTH                                   0x1
#define _PORTJ_RJ7_MASK                                     0x80
#define _PORTJ_ALE_POSN                                     0x0
#define _PORTJ_ALE_POSITION                                 0x0
#define _PORTJ_ALE_SIZE                                     0x1
#define _PORTJ_ALE_LENGTH                                   0x1
#define _PORTJ_ALE_MASK                                     0x1
#define _PORTJ_OE_POSN                                      0x1
#define _PORTJ_OE_POSITION                                  0x1
#define _PORTJ_OE_SIZE                                      0x1
#define _PORTJ_OE_LENGTH                                    0x1
#define _PORTJ_OE_MASK                                      0x2
#define _PORTJ_WRL_POSN                                     0x2
#define _PORTJ_WRL_POSITION                                 0x2
#define _PORTJ_WRL_SIZE                                     0x1
#define _PORTJ_WRL_LENGTH                                   0x1
#define _PORTJ_WRL_MASK                                     0x4
#define _PORTJ_WRH_POSN                                     0x3
#define _PORTJ_WRH_POSITION                                 0x3
#define _PORTJ_WRH_SIZE                                     0x1
#define _PORTJ_WRH_LENGTH                                   0x1
#define _PORTJ_WRH_MASK                                     0x8
#define _PORTJ_BA0_POSN                                     0x4
#define _PORTJ_BA0_POSITION                                 0x4
#define _PORTJ_BA0_SIZE                                     0x1
#define _PORTJ_BA0_LENGTH                                   0x1
#define _PORTJ_BA0_MASK                                     0x10
#define _PORTJ_CE_POSN                                      0x5
#define _PORTJ_CE_POSITION                                  0x5
#define _PORTJ_CE_SIZE                                      0x1
#define _PORTJ_CE_LENGTH                                    0x1
#define _PORTJ_CE_MASK                                      0x20
#define _PORTJ_LB_POSN                                      0x6
#define _PORTJ_LB_POSITION                                  0x6
#define _PORTJ_LB_SIZE                                      0x1
#define _PORTJ_LB_LENGTH                                    0x1
#define _PORTJ_LB_MASK                                      0x40
#define _PORTJ_UB_POSN                                      0x7
#define _PORTJ_UB_POSITION                                  0x7
#define _PORTJ_UB_SIZE                                      0x1
#define _PORTJ_UB_LENGTH                                    0x1
#define _PORTJ_UB_MASK                                      0x80
#define _PORTJ_NOT_OE_POSN                                  0x1
#define _PORTJ_NOT_OE_POSITION                              0x1
#define _PORTJ_NOT_OE_SIZE                                  0x1
#define _PORTJ_NOT_OE_LENGTH                                0x1
#define _PORTJ_NOT_OE_MASK                                  0x2
#define _PORTJ_NOT_WRL_POSN                                 0x2
#define _PORTJ_NOT_WRL_POSITION                             0x2
#define _PORTJ_NOT_WRL_SIZE                                 0x1
#define _PORTJ_NOT_WRL_LENGTH                               0x1
#define _PORTJ_NOT_WRL_MASK                                 0x4
#define _PORTJ_NOT_WRH_POSN                                 0x3
#define _PORTJ_NOT_WRH_POSITION                             0x3
#define _PORTJ_NOT_WRH_SIZE                                 0x1
#define _PORTJ_NOT_WRH_LENGTH                               0x1
#define _PORTJ_NOT_WRH_MASK                                 0x8
#define _PORTJ_NOT_CE_POSN                                  0x5
#define _PORTJ_NOT_CE_POSITION                              0x5
#define _PORTJ_NOT_CE_SIZE                                  0x1
#define _PORTJ_NOT_CE_LENGTH                                0x1
#define _PORTJ_NOT_CE_MASK                                  0x20
#define _PORTJ_NOT_LB_POSN                                  0x6
#define _PORTJ_NOT_LB_POSITION                              0x6
#define _PORTJ_NOT_LB_SIZE                                  0x1
#define _PORTJ_NOT_LB_LENGTH                                0x1
#define _PORTJ_NOT_LB_MASK                                  0x40
#define _PORTJ_NOT_UB_POSN                                  0x7
#define _PORTJ_NOT_UB_POSITION                              0x7
#define _PORTJ_NOT_UB_SIZE                                  0x1
#define _PORTJ_NOT_UB_LENGTH                                0x1
#define _PORTJ_NOT_UB_MASK                                  0x80
#define _PORTJ_nOE_POSN                                     0x1
#define _PORTJ_nOE_POSITION                                 0x1
#define _PORTJ_nOE_SIZE                                     0x1
#define _PORTJ_nOE_LENGTH                                   0x1
#define _PORTJ_nOE_MASK                                     0x2
#define _PORTJ_nWRL_POSN                                    0x2
#define _PORTJ_nWRL_POSITION                                0x2
#define _PORTJ_nWRL_SIZE                                    0x1
#define _PORTJ_nWRL_LENGTH                                  0x1
#define _PORTJ_nWRL_MASK                                    0x4
#define _PORTJ_nWRH_POSN                                    0x3
#define _PORTJ_nWRH_POSITION                                0x3
#define _PORTJ_nWRH_SIZE                                    0x1
#define _PORTJ_nWRH_LENGTH                                  0x1
#define _PORTJ_nWRH_MASK                                    0x8
#define _PORTJ_nCE_POSN                                     0x5
#define _PORTJ_nCE_POSITION                                 0x5
#define _PORTJ_nCE_SIZE                                     0x1
#define _PORTJ_nCE_LENGTH                                   0x1
#define _PORTJ_nCE_MASK                                     0x20
#define _PORTJ_nLB_POSN                                     0x6
#define _PORTJ_nLB_POSITION                                 0x6
#define _PORTJ_nLB_SIZE                                     0x1
#define _PORTJ_nLB_LENGTH                                   0x1
#define _PORTJ_nLB_MASK                                     0x40
#define _PORTJ_nUB_POSN                                     0x7
#define _PORTJ_nUB_POSITION                                 0x7
#define _PORTJ_nUB_SIZE                                     0x1
#define _PORTJ_nUB_LENGTH                                   0x1
#define _PORTJ_nUB_MASK                                     0x80

